🚀&nbsp; env0 had composed a PR Plan for environment [my-project / first-env](https://app.env0.com/p/8bac784a-a41a-45bf-a355-e26ce2bbdea2/environments/b437eeca-71ad-445f-a0d0-b3683c409bd2):
```
Plan: 1 to add, 0 to change, 1 to destroy.
```
<details>
<summary>Plan Details</summary>

```
  # module.mod2.aws_ssm_parameter.mod2_1 has changed
  ~ resource "aws_ssm_parameter" "mod2_1" {
        id        = "/gitlab-module2-project1-dev"
        name      = "/gitlab-module2-project1-dev"
      + tags      = {}
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:


  # module.mod1.aws_ssm_parameter.mod1_1 must be replaced
-/+ resource "aws_ssm_parameter" "mod1_1" {
      ~ arn       = "arn:aws:ssm:eu-west-2:067784040964:parameter/gitlab-module1-project1-dev" -> (known after apply)
      ~ data_type = "text" -> (known after apply)
      ~ id        = "/gitlab-module1-project1-dev" -> (known after apply)
      + key_id    = (known after apply)
      ~ name      = "/gitlab-module1-project1-dev" -> "/gitlab-module1-project1-pr-dev" # forces replacement
      - tags      = {} -> null
      ~ tags_all  = {} -> (known after apply)
      ~ version   = 1 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```
</details>


[Full PR Plan logs on env0](https://app.env0.com/p/8bac784a-a41a-45bf-a355-e26ce2bbdea2/environments/b437eeca-71ad-445f-a0d0-b3683c409bd2/deployments/177057d3-cebd-4439-8db4-542ff42fab18)